![New York City schoolbus](schoolbus.jpg)

Photo by [Jannis Lucas](https://unsplash.com/@jannis_lucas) on [Unsplash](https://unsplash.com).
<br>

Every year, American high school students take SATs, which are standardized tests intended to measure literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with a **maximum score of 800 points**. These tests are extremely important for students and colleges, as they play a pivotal role in the admissions process.

Analyzing the performance of schools is important for a variety of stakeholders, including policy and education professionals, researchers, government, and even parents considering which school their children should attend. 

You have been provided with a dataset called `schools.csv`, which is previewed below.

You have been tasked with answering three key questions about New York City (NYC) public school SAT performance.

In [1]:
# Re-run this cell 
import pandas as pd

# Read in the data
schools = pd.read_csv("schools.csv")

# Preview the data
schools.head()

# Start coding here...
# Add as many cells as you like...

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

In [2]:
schools = schools.sort_values("average_math", ascending = False)
schools

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
88,Stuyvesant High School,Manhattan,M477,754,697,693,97.4
170,Bronx High School of Science,Bronx,X445,714,660,667,97.0
93,Staten Island Technical High School,Staten Island,R440,711,660,670,99.7
365,Queens High School for the Sciences at York Co...,Queens,Q774,701,621,625,97.9
68,"High School for Mathematics, Science, and Engi...",Manhattan,M812,683,610,596,92.6
...,...,...,...,...,...,...,...
337,Pan American International High School,Queens,Q744,340,320,318,31.9
234,Dr. Susan S. McKinney Secondary School of the ...,Brooklyn,K265,332,346,350,55.1
242,W. H. Maxwell Career and Technical Education H...,Brooklyn,K660,326,333,350,38.5
247,Multicultural High School,Brooklyn,K420,319,323,284,NaN
182,Pan American International High School at Monroe,Bronx,X420,317,315,292,65.6

In [16]:
best_math_schools = schools[schools["average_math"] >= 0.8 * 800][["school_name", "average_math"]]
best_math_schools

                                           school_name  average_math
88                              Stuyvesant High School           754
93                 Staten Island Technical High School           711
170                       Bronx High School of Science           714
174  High School of American Studies at Lehman College           669
333                        Townsend Harris High School           680
365  Queens High School for the Sciences at York Co...           701
280                     Brooklyn Technical High School           682
45                       Eleanor Roosevelt High School           641
68   High School for Mathematics, Science, and Engi...           683
0    New Explorations into Science, Technology and ...           657

In [27]:
schools["total_SAT"] = schools["average_math"] + schools["average_reading"] + schools["average_writing"]
schools.sort_values("total_SAT", ascending = False, inplace = True)

In [18]:
top_10_schools = schools.loc[:, ["school_name", "total_SAT"]].head(10)
top_10_schools

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

In [19]:
num_schools = schools.groupby("borough")["school_name"].count()
num_schools = num_schools.iloc[2 : 3]
num_schools

borough
Manhattan    89
Name: school_name, dtype: int64

In [20]:
std_SAT_filter = schools.groupby("borough")["total_SAT"].agg("std").round(2)
std_SAT_filter.sort_values(ascending = False, inplace = True)
std_SAT_filter

borough
Manhattan        230.29
Staten Island    222.30
Queens           195.25
Brooklyn         154.87
Bronx            150.39
Name: total_SAT, dtype: float64

In [21]:
std_SAT = std_SAT_filter.iloc[: 1]
std_SAT

borough
Manhattan    230.29
Name: total_SAT, dtype: float64

In [22]:
average_SAT_filter = schools.groupby("borough")["total_SAT"].mean().round(2)
average_SAT_filter.sort_values(ascending = False, inplace = True)
average_SAT_filter

borough
Staten Island    1439.00
Queens           1345.48
Manhattan        1340.13
Brooklyn         1230.26
Bronx            1202.72
Name: total_SAT, dtype: float64

In [23]:
average_SAT = average_SAT_filter.iloc[2: 3]
average_SAT

borough
Manhattan    1340.13
Name: total_SAT, dtype: float64

In [29]:
largest_std_dev = pd.concat([num_schools, average_SAT, std_SAT], axis=1)
largest_std_dev

           school_name  total_SAT  total_SAT
borough
Manhattan           89    1340.13     230.29

In [25]:
largest_std_dev.columns = ["num_schools", "average_SAT", "std_SAT"]
largest_std_dev

           num_schools  average_SAT  std_SAT
borough
Manhattan           89      1340.13   230.29